/* Подумать над структурой класса Ноутбук для магазина техники - выделить поля и методы. Реализовать в java.
Создать множество ноутбуков.
Написать метод, который будет запрашивать у пользователя критерий (или критерии) фильтрации и выведет ноутбуки, отвечающие фильтру. 
Например: “Введите цифру, соответствующую необходимому критерию: 
1 - ОЗУ
2 - Объем ЖД
3 - Операционная система
4 - Цвет …
Далее нужно запросить минимальные значения для указанных критериев.
Отфильтровать ноутбуки их первоначального множества и вывести проходящие по условиям. */

public class FinalWork {
    public static void main(String[] args) {
        notebookShop.shopInterface();
    }
}
